# Задача №41. 
# Дан массив, состоящий из целых чисел.
# Напишите программу, которая в данном
# массиве определит количество элементов,
# у которых два соседних и, при этом,
# оба соседних элемента меньше данного.

# Сначала вводится число N — количество
# элементов в массиве. Далее записаны N
# чисел — элементы массива.
# Массив состоит из целых чисел.




# mas1, mas2 = list(map(int, input().split())), list(map(int, input().split()))
# print([i for i in mas1 if i not in mas2])